src/main/resources/templates/LBExchangeRate.ftl.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<getExchangeRate xmlns="http://webservices.lb.lt/ExchangeRates">
			<Currency>${from}</Currency>
			<Date>2014-12-31</Date>
		</getExchangeRate>
	</soap:Body>
</soap:Envelope>